# リセット
R = "\033[0m"

# 通常色（前景）
K = "\033[30m"   # 黒
RD = "\033[31m"  # 赤
G = "\033[32m"  # 緑
YE = "\033[33m"  # 黄
B = "\033[34m"   # 青
MG = "\033[35m"  # マゼンタ
C = "\033[36m"   # シアン
W = "\033[37m"   # 白

# 明るい色（前景）
LRD = "\033[91m"  # 明るい赤
LGN = "\033[92m"  # 明るい緑
LYE = "\033[93m"  # 明るい黄
LB = "\033[94m"   # 明るい青
LMG = "\033[95m"  # 明るいマゼンタ
LC = "\033[96m"   # 明るいシアン
LW = "\033[97m"   # 明るい白

# 背景色
BK = "\033[40m"   # 背景 黒
BRD = "\033[41m"  # 背景 赤
BGN = "\033[42m"  # 背景 緑
BYE = "\033[43m"  # 背景 黄
BB = "\033[44m"   # 背景 青
BMG = "\033[45m"  # 背景 マゼンタ
BC = "\033[46m"   # 背景 シアン
BW = "\033[47m"   # 背景 白

# スタイル
BOLD = "\033[1m"
UL = "\033[4m"     # 下線
REV = "\033[7m"    # 反転
HIDE = "\033[8m"   # 非表示

# 組み合わせ（よく使うもの）
BR = "\033[1;31m"   # 太字赤
BG = "\033[1;32m"   # 太字緑
BBL = "\033[1;34m"  # 太字青
BY = "\033[1;33m"   # 太字黄
BM = "\033[1;35m"   # 太字マゼンタ
BCY = "\033[1;36m"  # 太字シアン

# 辞書型
COLOR_DICT = {
    'R': R,
    'K': K,
    'RD': RD,
    'G': G,
    'YE': YE,
    'B': B,
    'MG': MG,
    'C': C,
    'W': W,
    'LRD': LRD,
    'LGN': LGN,
    'LYE': LYE,
    'LB': LB,
    'LMG': LMG,
    'LC': LC,
    'LW': LW,
    'BK': BK,
    'BRD': BRD,
    'BGN': BGN,
    'BYE': BYE,
    'BB': BB,
    'BMG': BMG,
    'BC': BC,
    'BW': BW,
    'BOLD': BOLD,
    'UL': UL,
    'REV': REV,
    'HIDE': HIDE,
    'BR': BR,
    'BG': BG,
    'BBL': BBL,
    'BY': BY,
    'BM': BM,
    'BCY': BCY
}